{"path":"blog/toyplot","templateID":5,"sharedPropsHashes":{},"localProps":{"post":{"content":"\r\nMy previous attempts at using python for plotting saw me use the massive and widely used library of [Matplotlib](https://matplotlib.org). I managed to produce some workable plots which I exported to jpeg and used on one of my [medium articles](https://medium.com/@lukewiwa/the-2020-code-of-points-what-we-might-expect-28afdab4b095). Although extremely customisable and functional I began the search for a plotting library with a nicer API that would export to more web friendly formats such as html and SVG.\r\n\r\nAfter some searching I stumbled upon [toyplot](http://toyplot.readthedocs.io) which I've been quite happy with. I went ahead and updated the plots from my medium article using the library and uploaded the results to where I've mirrored that medium article [here](/blog/the_2020_code_predictions). The format options are various but I decided to export to an html/css/js format and simply copied and pasted into my static site generator.\r\n\r\nThe API is quite straight forward, it boils down to a single `Canvas` object which you can then add different attributes to. It's a nice way to block together the things you want. It doesn't seem to have hard opinions about what plot you are building to begin with which for me is nice as it generalises my code across different graph types. You tend to always begin the same way. Here's a quick snippet of the heat map plots I produced with it.\r\n\r\n```python\r\nimport pandas as pd\r\nimport toyplot\r\nimport toyplot.html\r\n\r\n# initialise a pandas dataframe of the code of points\r\nwith open(csv, 'r') as f:\r\n    data = pd.read_csv(f)\r\n\r\n# Produce heat map matrix. I chose Rings\r\napp_name = 'Rings'\r\nmatrix = pd.crosstab(\r\n    data[data.app==app_name].value,\r\n    data.eg,\r\n)\r\n\r\n# Some variables to make the plot pretty\r\ndomain_min = matrix.values.min()\r\ndomain_max = matrix.values.max()\r\ntlocator=toyplot.locator.Explicit(labels=list(matrix))\r\nllocator=toyplot.locator.Explicit(labels=list(matrix.index))\r\nwidth = 500\r\nheight = 600\r\nlabel = app_name\r\ntlabel = \"Element Group\"\r\nllabel = \"Value\"\r\ncolormap = toyplot.color.brewer.map(\r\n    \"Greens\",\r\n    reverse=True,\r\n    domain_min=domain_min,\r\n    domain_max=domain_max,\r\n)\r\n\r\n# initialise the Canvas object with variables above\r\napp_canvas, app_table = toyplot.matrix(\r\n    (matrix, colormap),\r\n    tlocator=tlocator,\r\n    llocator=llocator,\r\n    width=width,\r\n    height=height,\r\n    label=label,\r\n    tlabel=tlabel,\r\n    llabel=llabel,\r\n)\r\n\r\n# Clean up the Canvas, give it a name and render in html\r\napp_table.body.grid.hlines[[0,-1],...] = \"single\"\r\napp_table.body.grid.vlines[...,[0,-1]] = \"single\"\r\nplot_name = \"{}.html\".format(app_name)\r\ntoyplot.html.render(\r\n    app_canvas,\r\n    plot_name,\r\n)\r\n```\r\nThe output is a rather nice looking plot based on html, css and javascript. The result is below.\r\n\r\n![cool graph](/graphs/sr.svg)\r\n\r\nThe full code is available on [Github](https://github.com/lukewiwa/matrix_plots_code_of_points) for anybody interested.","data":{"title":"Toyplot - A Simple Python Plotting Library","slug":"toyplot","layout":"simple_page","date":"12/07/2017","teaser":"My previous attempts at using python for plotting saw me use the massive and widely used library of Matplotlib. I managed to produce some workable plots which I exported to jpeg and used on one of my medium articles. Although extremely customisable and functional I began the search for a plotting library with a nicer API that would export to more web friendly formats such as html and SVG."},"isEmpty":false,"excerpt":"","path":"blog/toyplot.md"}}}
